# Напишите программу, в которой программа запрашивает у пользователя день и месяц,
# а затем выводит сообщение о текущем дне и месяце
day=input("Введите день месяца ")
month=input("Введите месяц ")
print("Текущая дата: ", day+" "+month)