# Напишите программу, в которой расстояние, указанное в милях, переводится в километры.
# Учесть, что одна миля примерно равна 1,6 километра. Расстояние в милях вводится пользователем с клавиатуры
miles=int(input("Введите расстояние в милях: "))
print("Расстояние в км: ", miles*1.6)