# Напишите программу, в которой пользователь должен ввести текущий год и год своего рождения.
# Программа вычисляет возраст польхователя и выводит соответствующее сообщение.
year=int(input("Введите текущий год "))
bday=int(input("Введите год своего рождения "))
print("Ваш возраст ", year-bday)
